def main():
    print("Вітаємо вас у нашому магазинi!\n")
    brand = input("Яку марку ноутбука ви розглядаєте? ")
    model = input("Яку модель ноутбука ви хочете? ")
    color = input("Якого кольору ви бажаєте ноутбук? ")
    memory = input("Скiльки пам'ятi вам потрiбно? ")
    purpose = input("Для яких цілей ви купуєте ноутбук (роботи, ігр, навчання)? ")

    print(f"\nПідсумкова інформація:")
    print(f"Ви обрали  {brand} {model}, {color} кольору на {memory} gb , який плануєте використовувати для {purpose}.")


if __name__ == "__main__":
    main()